/**
 * Created by wangxi on 18/7/30.
 */
import config from './config/config.json'
import natures from './config/natures.json'

class Constants {

   // static data = {
   //      "诊断":{
   //          "词性":['否定词','不否定词','诊断','部位','部位描绘'],
   //          "实体字段名":['诊断','诊断程度','部位','部位描绘','是否存在','诊断程度状态','诊断修饰']
   //      },
   //     "用药":{
   //         "词性":['频度单位','数值单位','用药',"用药方式"],
   //         "实体字段名":['部位描绘','部位','用药方式',"频次","是否使用","剂量单位","剂量数值","病历示总剂量数值","病历示总剂量数值单位","带药规格","病历示总剂量","用药持续时间","剂量","用药","取药量","单规格剂量"]
   //     },
   //     "化验":{
   //
   //     },
   //     "症状":{
   //
   //     },
   //     "功能描述":{
   //
   //     },
   //     "家族史":{
   //         "实体字段名":["成员数量","家族成员","成员年纪","是否在世","患病年数","健康状况","死因","家族病史判定词","家族病史"]
   //     },
   //     "烟酒毒麻":{
   //         "实体字段名":["时间描述","瘾史判定词","瘾史类型","吸食/戒用持续时间","吸食描述","主要嗜用类型","嗜用方式","嗜用浓度","吸食量","吸食量单位","吸食高峰量","吸食高峰量单位","吸食频度单位","吸烟指数"]
   //     },
   //     "过敏史":{
   //         "实体字段名":['特异体质',"信息可靠情况","过敏判定词","过敏原","测试方式","测试结果","过敏症状否定词","过敏部位描绘","过敏部位","过敏症状描绘","过敏症状","治疗用药","治疗效果"]
   //     },
   //     "生育史":{
   //         "实体字段名":["生产状况","怀孕状况","足月生","早产","流产","存活","顺产","剖腹产","死产"]
   //     },
   //     "月经史":{
   //         "实体字段名":["变化节点","初潮时间","行经天数","月经周期","月经周期描述","末次月经时间","绝经时间","痛经","月经量","血块","白带","分泌物","分泌物描述","异常阴道流血","月经状况"]
   //     }
   //  }
   //
   //  static natures =
   //      [
   //          "症状变化",
   //          "化验项类别",
   //          "不否定词",
   //          "化验描绘词",
   //          "诊断",
   //          "峰值副词",
   //          "化验组",
   //          "段落标题",
   //          "检查项内容",
   //          "检查行为动词",
   //          "时间长度",
   //          "冲击治疗周期",
   //          "行为动词",
   //          "动词",
   //          "药物治疗",
   //          "市",
   //          "可忽略",
   //          "药厂",
   //          "频度单位",
   //          "状态变化词",
   //          "症状程度",
   //          "化验项",
   //          "肯定词",
   //          "病状描绘词",
   //          "否定词",
   //          "化验条件词",
   //          "部位",
   //          "病症证物",
   //          "部位量词",
   //          "医院",
   //          "ICD",
   //          "检查结果",
   //          "药品量词",
   //          "诊断程度词",
   //          "科室",
   //          "药品副词",
   //          "医疗措施",
   //          "一般情况问诊",
   //          "时间",
   //          "症状",
   //          "检查子项",
   //          "程度关键词",
   //          "诱因",
   //          "特殊词",
   //          "功能描述",
   //          "次数单位",
   //          "有害物质",
   //          "既往史",
   //          "就诊动词",
   //          "患者",
   //          "人名",
   //          "性别",
   //          "假设词",
   //          "地址",
   //          "购药量",
   //          "部位描绘词",
   //          "序号标题",
   //          "存在动词",
   //          "段落内标题",
   //          "物理治疗",
   //          "民族",
   //          "时间副词",
   //          "部位修正词",
   //          "检查项",
   //          "连接介词",
   //          "治疗行为",
   //          "模糊范围",
   //          "疾病类别",
   //          "不良嗜好",
   //          "标点符号",
   //          "人体系统",
   //          "组织",
   //          "既往史结束词",
   //          "取值符号",
   //          "区",
   //          "用药方式",
   //          "数值单位",
   //          "用药调整",
   //          "用药",
   //          "过滤词",
   //          "功能",
   //          "频度副词",
   //          "手术",
   //          "省",
   //          "记录类型",
   //          "基因",
   //          "医疗器械",
   //          "器械描述",
   //          "家族成员",
   //          "操作手法",
   //          "手术操作",
   //          "操作条件"
   //      ]
   //


    static getAllType(){
        return config;
    }

    static  getTypeData(key){
        return config[key];
    }

    static getAllNatures(){
        return natures["词性"];
    }

}

export default Constants;
